Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровОбщие/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Запись		= Форма.Запись;
	Элементы	= Форма.Элементы;
	
	Элементы.ГруппаСрокОплаты.Видимость = (ТипЗнч(Запись.Договор) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") 
									  		ИЛИ (ТипЗнч(Запись.Договор) = Тип("СправочникСсылка.Договоры") И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Договор, "ВидДоговора") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДополнительноеСоглашение")));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасторженияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.ДатаРасторжения)
		Или Не ЗначениеЗаполнено(Запись.Договор) Тогда
		Возврат;
	КонецЕсли;
	
	АдресДерева = ПолучитьАдресДереваДочернихЭлементов(Запись.Договор, ЭтаФорма.УникальныйИдентификатор);
	Если Не ЗначениеЗаполнено(АдресДерева) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеРеквизиты = Новый Массив;
	ДополнительныеРеквизиты.Добавить(Новый Структура("Имя, ТипЗначения, Заголовок, Значение",
		"ДатаЗакрытия",
		Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)),
		"Дата расторжения",
		Запись.ДатаРасторжения));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РежимВыбора",               Истина);
	ДополнительныеПараметры.Вставить("МножественныйВыбор",        Истина);
	ДополнительныеПараметры.Вставить("ЗапретитьСнятиеОтметок",   Истина);
	ДополнительныеПараметры.Вставить("ВидимыеКолонки",            "Представление");
	ДополнительныеПараметры.Вставить("ДополнительныеРеквизиты",   ДополнительныеРеквизиты);
	ДополнительныеПараметры.Вставить("ПутьКДаннымКартинкиСтроки", "ДеревоЗначений.ДанныеКартинки");
	ДополнительныеПараметры.Вставить("КартинкаСтрок",             БиблиотекаКартинок.РегистрСведенийЗапись);
	
	РезультатВопроса = РаботаСФормамиКлиент.ПоказатьДеревоЗначений(
		АдресДерева,
		"При расторжении договора будут закрыты дочерние элементы:",
		ЭтаФорма,
		РежимДиалогаВопрос.ОКОтмена,
		КодВозвратаДиалога.ОК,
		"Закрытие договора",
		ДополнительныеПараметры);
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСФормамиКлиентСервер.ЗаписатьФорму(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСИсполнителями.ЗакрытьДеревоЭлементов(
		ДополнительныеПараметры.АдресДереваЗначений,
		ДополнительныеПараметры.ДополнительныеРеквизиты.ДатаЗакрытия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресДереваДочернихЭлементов(Договор, УникальныйИдентификаторФормы)
	
	Если ТипЗнч(Договор) <> Тип("СправочникСсылка.Договоры") Тогда
		Возврат "";
	КонецЕсли;
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ОтветственногоХранения);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ВеденияРеестра);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания);
	
	Если ВидыДоговоров.Найти(ВидДоговора) = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	// ОтображатьКорневойУзел = Ложь: договор сохраняется через ЗаписатьФорму,
	// в дерево включаем только счета → разделы → исполнителей.
	АдресДерева = РаботаСИсполнителями.ПолучитьДочерниеЭлементы(
		Договор,
		,
		"ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)",
		Ложь,
		УникальныйИдентификаторФормы);
	
	Дерево = ПолучитьИзВременногоХранилища(АдресДерева);
	Дерево.Колонки.Вставить(0, "Отметка", Новый ОписаниеТипов("Булево"), " ");
	ОтметитьВсеСтрокиДерева(Дерево.Строки);
	Возврат ПоместитьВоВременноеХранилище(Дерево, УникальныйИдентификаторФормы);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтметитьВсеСтрокиДерева(Строки)
	Для Каждого Строка Из Строки Цикл
		Строка.Отметка = Истина;
		ОтметитьВсеСтрокиДерева(Строка.Строки);
	КонецЦикла;
КонецПроцедуры
